app/views/applications/_form.html.erb

SELECT "schools".* FROM "schools" ORDER BY "schools"."name" ASC
---
  <%= f.label "School" %>
  <%= f.collection_select :school_id, School.order(:name), :id, :name %>