app/controllers/applications_controller.rb

  def index
    if current_user
      @applications = current_user.applications.joins(:school).order('school_type asc','name asc')
---
SELECT "applications".* FROM "applications" INNER JOIN "schools" ON "schools"."id" = "applications"."school_id" WHERE "applications"."user_id" = ? ORDER BY school.school_type asc, school.name asc  [["user_id", 1]]

  def create
    @application = Application.new(application_params)
    @application.user = current_user

    respond_to do |format|
      if @application.save
---
INSERT INTO "applications" ("submit_date", "success", "created_at", "updated_at", "user_id", "school_id") VALUES (?, ?, ?, ?, ?, ?)  [["submit_date", Sat, 19 Nov 2016], ["success", false], ["created_at", 2016-10-31 03:45:32 UTC], ["updated_at", 2016-10-31 03:45:32 UTC], ["user_id", 1], ["school_id", 1]]

  def update
    respond_to do |format|
      if @application.update(application_params)
---
UPDATE "applications" SET "interview_date" = ?, "updated_at" = ? WHERE "applications"."id" = ?  [["interview_date", 2016-12-19 16:10:00 UTC], ["updated_at", 2016-10-31 14:29:15 UTC], ["id", 2]]

  def destroy
    @application.destroy
---
DELETE FROM "applications" WHERE "applications"."id" = ?  [["id", 1]]

    def set_application
      @application = Application.find(params[:id])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]