app/controllers/attachments_controller.rb

  def index
    @attachments = Attachment.order(document_updated_at: :desc).paginate(:page => params[:page], :per_page => 10)
---
SELECT  "attachments".* FROM "attachments" ORDER BY "attachments"."document_updated_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def create
    @attachment = Attachment.new(attachment_params)
    @attachment.user = current_user

    respond_to do |format|
      if @attachment.save
---
INSERT INTO "attachments" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["user_id", 1], ["created_at", 2016-11-09 04:23:03 UTC], ["updated_at", 2016-11-09 04:23:03 UTC]]

  def destroy
    @attachment.destroy
---
DELETE FROM "attachments" WHERE "attachments"."id" = ?  [["id", 2]]

    def set_attachment
      @attachment = Attachment.find(params[:id])
---
SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]