app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools" ORDER BY "schools"."name" ASC
---
  def index
    @schools = School.order(:name)