app/controllers/schools_controller.rb

  def index
    @schools = School.order(:school_type, :name).paginate(:page => params[:page], :per_page => 10)
---
SELECT  "schools".* FROM "schools" ORDER BY "schools"."school_type" ASC, "schools"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "schools"

  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save
---
INSERT INTO "schools" ("name", "banding", "district", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test1"], ["banding", "1A"], ["district", "Shatin"], ["deadline", Fri, 30 Dec 2016], ["created_at", 2016-10-30 13:53:40 UTC], ["updated_at", 2016-10-30 13:53:40 UTC]]

  def update
    respond_to do |format|
      if @school.update(school_params)
---
UPDATE "schools" SET "name" = ?, "banding" = ?, "district" = ?, "deadline" = ?, "updated_at" = ? WHERE "schools"."id" = ?  [["name", "Test2"], ["banding", "1B"], ["district", "Shatin"], ["deadline", Thu, 01 Dec 2016], ["updated_at", 2016-10-31 03:44:10 UTC], ["id", 2]]

    def set_school
      @school = School.find(params[:id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]